In [1]:
# Import Libraries
import pandas as pd

In [2]:
# Create pd.DataFrame()
data = pd.DataFrame({"Name": ['Andrew', 'Brad', 'Mary', 'Mike'],
                     "Salary": [60, 75, 100, 150]})

In [3]:
# Display the updated DataFrame
data

     Name  Salary
0  Andrew      60
1    Brad      75
2    Mary     100
3    Mike     150

In [4]:
# Create "New Salary" column and multiplying the salaries by 2
Multiply_2 = lambda x: x*2
data["New Salary"] = Multiply_2(data["Salary"])
data

     Name  Salary  New Salary
0  Andrew      60         120
1    Brad      75         150
2    Mary     100         200
3    Mike     150         300

In [5]:
# Create the flag column to check if New Salary >= 150
data['New Salary >= 150'] = data['New Salary'].apply(lambda x: x >= 150)

In [6]:
# Display the updated DataFrame
data

     Name  Salary  New Salary  New Salary >= 150
0  Andrew      60         120              False
1    Brad      75         150               True
2    Mary     100         200               True
3    Mike     150         300               True